{
  "nav": {
    "home": "Inici",
    "about": "Sobre mi",
    "projects": "Projectes",
    "contact": "Contacte",
    "downloadButton": "Descarregar CV"
  },
  "home": {
    "subtitle": "Desenvolupador Web Fullstack"
  },
  "about": {
    "title": "Sobre mi",
    "text": {
      "intro": "Hola! El meu nom és ",
      "name": "Hugo",
      "introSection": ". Sóc un desenvolupador web fullstack amb passió per crear aplicacions modernes, funcionals i ben estructurades. Des del backend fins al frontend, m’encanta tot el procés de desenvolupament i gaudeixo especialment quan puc resoldre problemes complexos. A més, tinc experiència en la creació d’aplicacions mòbils.",
      "tecnologiesSection": "Treballo principalment amb tecnologies com Express per construir APIs robustes i escalables. Al frontend, sovint faig servir frameworks com React i Angular per desenvolupar interfícies interactives. També utilitzo Astro per crear llocs ràpids i optimitzats. A més, tinc experiència en el desenvolupament d’aplicacions mòbils amb React Native, cosa que em permet crear aplicacions multiplataforma amb una excel·lent experiència d'usuari.",
      "learningSection": "Em considero una persona que aprèn ràpid i sempre busco maneres de millorar les meves habilitats i mantenir-me actualitzat amb les últimes tendències tecnològiques. Tant si treballo en equip com individualment, gaudeixo col·laborant en projectes i trobant solucions innovadores que aportin valor real.",
      "finalSection": "Si estàs buscant algú que pugui construir aplicacions de principi a fi, m’encantaria treballar amb tu i ajudar a portar el teu projecte al següent nivell.",
      "letsTalk": "Parlem!"
    },
    "categories": {
      "frontend": "Frontend",
      "backend": "Backend",
      "tools": "Eines"
    }
  },
  "projects": {
    "title": "Projectes",
    "workInProgress": "Treball en procés",
    "formula1Showcase": {
      "description": "Plataforma que mostra els equips de Fórmula 1 amb dades obtingudes mitjançant una API personalitzada."
    },
    "personalPortfolio": {
      "description": "Lloc web personal on es destaquen projectes, habilitats i experiència professional."
    },
    "autodetailinges": {
      "description": "Pàgina informativa per a una empresa de serveis de detailing de cotxes, optimitzada per a SEO i rendiment."
    },
    "UNImate": {
      "description": "Aplicació mòbil desenvolupada amb React Native dissenyada per ajudar estudiants universitaris: fòrum, informació sobre universitats (facultats, carreres universitàries), connectar amb persones noves, etc."
    },
    "footballShirtShop": {
      "description": "Demo de botiga en línia per a la compra de samarretes de futbol personalitzades, amb un disseny intuïtiu i segur."
    },
    "alt": "imatge de vista prèvia",
    "techStack": {
      "frontend": "Frontend",
      "backend": "Backend"
    }
  },
  "contact": {
    "title": "Contacte",
    "form": {
      "name": {
        "label": "Nom",
        "errorRequired": "El nom és obligatori"
      },
      "email": {
        "label": "Email",
        "errorRequired": "El correu electrònic és obligatori",
        "errorInvalid": "El correu electrònic no és vàlid"
      },
      "subject": {
        "label": "Assumpte",
        "placeholder": "Per què et poses en contacte amb mi?",
        "errorRequired": "L'assumpte és obligatori"
      },
      "message": {
        "label": "Missatge",
        "placeholder": "Explica'm més...",
        "errorRequired": "El missatge és obligatori"
      }
    },
    "submit": "Enviar",
    "modal": {
      "success": {
        "title": "Formulari enviat amb èxit",
        "message": "Gràcies per contactar-me!"
      },
      "error": {
        "title": "Error en enviar el formulari",
        "message": "Ups! Alguna cosa ha fallat."
      },
      "close": "Tancar"
    }
  },
  "head": {
    "home": {
      "title": "Hugo GB | Desenvolupador Web",
      "description": "Pàgina principal del portafoli personal d'Hugo."
    },
    "about": {
      "title": "Hugo GB | Sobre mi",
      "description": "Pàgina sobre mi del portafoli personal d'Hugo."
    },
    "projects": {
      "title": "Hugo GB | Projectes",
      "description": "Pàgina de projectes del portafoli personal d'Hugo."
    },
    "contact": {
      "title": "Hugo GB | Contacte",
      "description": "Pàgina de contacte del portafoli personal d'Hugo."
    }
  }
}
